# Length Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextRange..::..Length Property
TextRange Class See Also
---
The length of the range.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int Length { get; set; }
```

Visual Basic
---
```text
Public Property Length As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Length {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for length is negative. |

# See Also
TextRange Class
Autodesk.Revit.DB Namespace